
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ВидСобытия", ВидСобытия) Тогда
		
	КонецЕсли;
	ОписаниеСобытия = Неопределено;
	Если Параметры.Свойство("ОписаниеСобытия", ОписаниеСобытия) Тогда
		Ученик = ОписаниеСобытия.Ученик;
		ДатаЗанятия = ОписаниеСобытия.ДатаЗанятия;
		ВремяЗанятия = ОписаниеСобытия.ВремяНачала;
		КоличествоАкадемическихЧасов = ОписаниеСобытия.КоличествоЧасов;
		СформироватьДатуВремяЗанятия(ДатаВремяЗанятия, ДатаЗанятия, ВремяЗанятия);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗанятияПриИзменении(Элемент)
	СформироватьДатуВремяЗанятия(ДатаВремяЗанятия, ДатаЗанятия, ВремяЗанятия);
КонецПроцедуры

&НаКлиенте
Процедура ВремяЗанятияПриИзменении(Элемент)
	СформироватьДатуВремяЗанятия(ДатаВремяЗанятия, ДатаЗанятия, ВремяЗанятия);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьСобытие(Команда)
	СтруктураСобытия = Новый Структура;
	СтруктураСобытия.Вставить("ВидСобытия"		, ВидСобытия);
	СтруктураСобытия.Вставить("ДатаЗанятия"		, ДатаЗанятия);
	СтруктураСобытия.Вставить("ВремяНачала"		, ВремяЗанятия);
	СтруктураСобытия.Вставить("Ученик"			, Ученик);
	СтруктураСобытия.Вставить("КоличествоЧасов"	, КоличествоАкадемическихЧасов);
	СтруктураСобытия.Вставить("Проведено"		, Ложь);
	СтруктураСобытия.Вставить("Идентификатор"	, "");
	Закрыть(СтруктураСобытия);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьДатуВремяЗанятия(ДатаВремяЗанятия, ДатаЗанятия, ВремяЗанятия)
	ДатаВремяЗанятия = ДатаЗанятия + (ВремяЗанятия - Дата(1, 1, 1));
КонецПроцедуры

#КонецОбласти