
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьЗанятия(Команда)
	ЗаписатьЗанятияНаСервере();
	Закрыть(Истина);
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЗанятияНаСервере()
	Для Каждого Строка Из ТаблицаЗанятий Цикл
		СтруктураЗанятия = Новый Структура;
		СтруктураЗанятия.Вставить("Ученик"			, Строка.Ученик);
		СтруктураЗанятия.Вставить("ДатаЗанятия"		, Строка.ДатаЗанятия);
		СтруктураЗанятия.Вставить("КоличествоЧасов"	, Строка.КоличествоАкадемическихЧасов);
		СтруктураЗанятия.Вставить("ВремяНачала"		, Строка.ВремяЗанятия);
		РегистрыСведений.ДБ_ПланыЗанятий.ДобавитьЗанятие(СтруктураЗанятия);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти