
#Область ОбработчикиСобытийЭлементовФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеФормой(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	УправлениеФормой(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область ПрочиеОбработчики

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Объект = Форма.Объект;
	Элементы = Форма.Элементы;

	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ДБ_ВидыУчетаРабочегоВремени.Языки") Тогда
		Элементы.УчетВремениЗадача.Видимость = Ложь;
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ДБ_ВидыУчетаРабочегоВремени.Программирование") Тогда
		Элементы.УчетВремениЗадача.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры // УправлениеФормой()

#КонецОбласти
