
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//ДокОбъект = РеквизитФормыВЗначение("Объект");
	Для Каждого СтрокаФайлов Из ТекущийОбъект.ПрисоединенныеФайлы Цикл
		ДвоичныеДанные = Новый ДвоичныеДанные(СтрокаФайлов.ИмяФайла);
		СтрокаФайлов.ДанныеФайла = Новый ХранилищеЗначения(ДвоичныеДанные);
	КонецЦикла;
	//ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПрисоединенныеФайлы

&НаКлиенте
Асинх Процедура ПрисоединенныеФайлыИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущиеДанные = Элементы.ПрисоединенныеФайлы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Фильтр = НСтр("ru = 'Выберите файл'") + "(*.*)|*.*";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите файлы";
	
	МассивФайлов = Ждать ДиалогОткрытияФайла.ВыбратьАсинх();
	Если МассивФайлов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущиеДанные.ИмяФайла = МассивФайлов[0];
КонецПроцедуры

#КонецОбласти
