
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МассивИменНастроек = РегистрыСведений.ДБ_ЗначенияНастроекПрограммы.ИменаНастроек();
	Элементы.ИмяНастройки.СписокВыбора.ЗагрузитьЗначения(МассивИменНастроек);
	Если НЕ Параметры.Ключ.Пустой() Тогда
		Элементы.ИмяНастройки.ТолькоПросмотр = Истина;
		ЗначениеНастройки = РегистрыСведений.ДБ_ЗначенияНастроекПрограммы.ЗначениеНастройки(Запись.ИмяНастройки);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ЗначениеНастройки = Новый ХранилищеЗначения(ЗначениеНастройки);
КонецПроцедуры


#КонецОбласти
