#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДБ_АктыВыполненныхРаботыВыполненныеЗадачи.Задача,
		|	ДБ_АктыВыполненныхРаботыВыполненныеЗадачи.Задача.Аналитика КАК Аналитика,
		|	ДБ_АктыВыполненныхРаботыВыполненныеЗадачи.Сумма,
		|	ДБ_АктыВыполненныхРаботыВыполненныеЗадачи.Ссылка.Дата КАК Период,
		|	ДБ_АктыВыполненныхРаботыВыполненныеЗадачи.Ссылка.Заказчик,
		|	&ВидДвижения
		|ИЗ
		|	Документ.ДБ_АктыВыполненныхРаботы.ВыполненныеЗадачи КАК ДБ_АктыВыполненныхРаботыВыполненныеЗадачи
		|ГДЕ
		|	ДБ_АктыВыполненныхРаботыВыполненныеЗадачи.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Движения.ДБ_АктыВыполненияРабот.Добавить(), ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	Движения.ДБ_АктыВыполненияРабот.Записывать = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти


#КонецЕсли
