#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Функция ЗаписьРасписания(Занятие) Экспорт
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = Занятие.Период;
	МенеджерЗаписи.УченикГруппа = Занятие.Ученик;
	МенеджерЗаписи.ДатаЗанятия = Занятие.ДатаЗанятия;
	МенеджерЗаписи.Прочитать();
	Возврат МенеджерЗаписи;
КонецФункции

// Удалить занятие.
// 
// Параметры:
//  Занятие - Структура
//	* Ученик
Процедура УдалитьЗанятие(Занятие) Экспорт
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.УченикГруппа.Установить(Занятие.Ученик);
	НаборЗаписей.Отбор.ДатаЗанятия.Установить(Занятие.ДатаЗанятия);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	ДБ_РаботаСКалендарем.УдалитьСобытие(Занятие.Идентификатор);
КонецПроцедуры

// Добавить занятие.
// 
// Параметры:
//  Занятие - Структура
//	* Ученик
Процедура ДобавитьЗанятие(Занятие) Экспорт
	ОписаниеСобытия = Занятие;
	ОписаниеСобытия.Вставить("Период", ТекущаяДатаСеанса());
	ЗаписьПланЗанятий = РегистрыСведений.ДБ_ПланыЗанятий.СоздатьМенеджерЗаписи();
	ЗаписьПланЗанятий.Период = ОписаниеСобытия.Период;
	ЗаписьПланЗанятий.УченикГруппа = Занятие.Ученик;
	ЗаписьПланЗанятий.ДатаЗанятия = Занятие.ДатаЗанятия;
	ЗаписьПланЗанятий.КоличествоЧасов = Занятие.КоличествоЧасов;
	ЗаписьПланЗанятий.ВремяПроведения = ДБ_РаботаСКалендарем.ПреобразоватьАкадемическиеЧасыВАстрономические(
			ЗаписьПланЗанятий.КоличествоЧасов);
	ЗаписьПланЗанятий.ДатаНачала = ЗаписьПланЗанятий.ДатаЗанятия + (Занятие.ВремяНачала - Дата(1, 1, 1));
	ЗаписьПланЗанятий.ДатаОкончания = ЗаписьПланЗанятий.ДатаНачала + (ЗаписьПланЗанятий.ВремяПроведения - Дата(1, 1, 1));
	ЗаписьПланЗанятий.Записать();
	ОписаниеСобытия.Вставить("ДатаНачала", ЗаписьПланЗанятий.ДатаНачала);
	ОписаниеСобытия.Вставить("ДатаОкончания", ЗаписьПланЗанятий.ДатаОкончания);
	ДБ_РаботаСКалендарем.ДобавитьСобытиеВКалендарьGoogle(ОписаниеСобытия);
КонецПроцедуры

#КонецОбласти

#КонецЕсли