#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	Для каждого ТекСтрока Из ВыполненныеЗадачи Цикл
		НоваяСтрока = Движения.ДБ_АктыВыполненияРабот.Добавить();
		НоваяСтрока.Период = Дата;
		НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
		НоваяСтрока.Заказчик = Заказчик;
		НоваяСтрока.Задача = ТекСтрока.Задача;
		НоваяСтрока.Сумма = ТекСтрока.Сумма;
	КонецЦикла;
	
	Движения.ДБ_АктыВыполненияРабот.Записывать            = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти


#КонецЕсли
