
#Область ОбработчикиСобытий

Функция get_task_report(ДатаНачала, ДатаОкончания)
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Задача");
	ТаблицаДанных.Колонки.Добавить("КоличествоЧасов");
	
	// Если период не задан, формируем за текущий год
	Отчет = Отчеты.ДБ_УчетРабочегоВремениНовый.Создать();
	СхемаКомпоновкиДанных = Отчет.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Отчет.КомпоновщикНастроек.Настройки, , , Тип(
		"ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаДанных);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

	МассивДанных = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаДанных);
	Результат = ДБ_ОбщегоНазначенияHTTP.СтрокаJSON(МассивДанных);
	
	Возврат Результат;
КонецФункции

#КонецОбласти
