
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Ученик", Ученик) Тогда
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьЗанятие(Команда)
	ДобавитьЗанятиеНаСервере();
	Закрыть(Истина);
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗанятиеНаСервере() 
	ЗаписьПланЗанятий = РегистрыСведений.ДБ_ПланыЗанятий.СоздатьМенеджерЗаписи();
	ЗаписьПланЗанятий.Период = ТекущаяДатаСеанса();
	ЗаписьПланЗанятий.УченикГруппа = Ученик;
	ЗаписьПланЗанятий.ДатаЗанятия = ДатаЗанятия;
	ЗаписьПланЗанятий.КоличествоЧасов = КоличествоАкадемическихЧасов;
	ЗаписьПланЗанятий.ВремяПроведения = ДБ_РаботаСКалендарем.ПреобразоватьАкадемическиеЧасыВАстрономические(ЗаписьПланЗанятий.КоличествоЧасов);
	ЗаписьПланЗанятий.ДатаНачала = ДатаЗанятия;
	ЗаписьПланЗанятий.ДатаОкончания = ЗаписьПланЗанятий.ДатаНачала + (ЗаписьПланЗанятий.ВремяПроведения - Дата(1, 1, 1));
	ЗаписьПланЗанятий.Записать();
	Событие = Новый Структура;
	Событие.Вставить("Заголовок", "" + Ученик);
	Событие.Вставить("ДатаНачала", ДБ_РаботаСКалендарем.ПреобразоватьДатуВФорматКалендаря(ЗаписьПланЗанятий.ДатаНачала));
	Событие.Вставить("ДатаОкончания", ДБ_РаботаСКалендарем.ПреобразоватьДатуВФорматКалендаря(ЗаписьПланЗанятий.ДатаОкончания));
	ЗаписьПланЗанятий.Идентификатор = ДБ_РаботаСКалендарем.ДобавитьСобытие(Событие);
	ЗаписьПланЗанятий.Записать();
КонецПроцедуры

#КонецОбласти